#pragma once

#include "resource.h"



#define SERVERIP	L"127.0.0.1"
#define SERVERPORT	5000

#define WM_SOCKET		WM_USER+1
#define WM_SOCKETERROR	WM_USER+2

void Update();
//---------------------------------------
//WindowMsg가 안 왔으면 처리해야하는 부분
//---------------------------------------

BOOL FrameSkip();	
//---------------------------------------
//Frame을 50으로 맞추기 위해서 render를
//Skip해야할 때 Skip한다.
//---------------------------------------

BOOL GameInit(void);
//---------------------------------------
//Spirte파일 받아오기
//---------------------------------------

void KeyProcess();	
//---------------------------------------
//KeyBoard입력 처리한다.
//---------------------------------------

void ObjSort();			
//---------------------------------------
//Object끼리 겹쳤을 때 좌표를 비교해서 앞에
//있는 애를 위에 그려주기 위해 sort한다.
//---------------------------------------
